#+TITLE: Thesis Structure
#+AUTHOR: Tigany Zarrouk


* Statement of the Problem 
  I do think that an underlying theme in your thesis can be what can and
  cannot be rendered in TB in the plasticity of transition metals with and
  without interstitials. And you can discuss how good (or rather bad) EAM
  is, especially with interstitials. You may also be sceptical of the DFT,
  especially in view of the difficulty with cell size and boundary
  conditions. And not forgetting that the French school's theory of jerky
  glice in Ti is based on a calculation of core energy difference that is
  within the error limits.

* Introduction: Literature Review
** Summary of Thesis

* Simulation Methodology
** Tight-binding
   - Explain tight-binding, from the perspective of maybe density
     functional theory / Horsfield [[file:papers/Horsfield_Smutna_Fogarty_fitting_TB_potentials_from_DFT_PhysRevMaterials.4.043801.pdf][Horsfield-Smutna-Fitting-TB]]

*** TODO Read Majeski & Vogel [[file:~/Documents/books/The%20Structures%20of%20Binary%20Compounds%20by%20J.%20Hafner,%20F.%20Hulliger,%20W.B.%20Jensen,%20J.A.%20Majewski,%20K.%20Mathis,%20P.%20Villars%20and%20P.%20Vogl%20(Eds.)%20(z-lib.org).pdf][Structures of binary compounds chapter 4]]
    DEADLINE: <2020-09-04 Fri>
    :PROPERTIES:
    :ORDERED:  t
    :END:
**** TODO Make notes of Majeski/Vogel
**** TODO Relate to DFT
 
*** TODO Read Horsfield-Smutna  [[file:papers/Horsfield_Smutna_Fogarty_fitting_TB_potentials_from_DFT_PhysRevMaterials.4.043801.pdf][Horsfield-Smutna-Fitting-TB]]
    DEADLINE: <2020-09-09 Wed>

*** TODO Read Heine 1980 [[file:papers/Electronic_Structure_from_the_Point_of_View_of_the_Local_Atomic_Environment_Heine_1980.pdf][Heine Local atomic structure]]
    DEADLINE: <2020-09-11 Fri>
       
*** TODO Summarise the theory - Consolidate here 
    DEADLINE: <2020-09-18 Fri>
   
** BOP
** Embedding
** Fitting
*** HOLD Explain why I chose to fit this way                           :HOLD:
    - State "HOLD"       from "HOLD"       [2020-09-01 Tue 21:32] \\
      Use theory e.g. discontinity of inverse Slater Koster in Bond
      Integrals. Waiting for writing.
    - Explain algorithms 
    - Regularization - Elastic Net
      - What's the benefit? 
    - How could I have made it better if it failed. 
    - Martin cite:Martin2004, states that 
      - A /small/ basis of /orthogonal/ functions /must/ be long-ranged and
	environmentally-dependent to be accurate.
      - Whereas non-orthogonal functions can describe the system will with
        short-ranged atomic range functions, independent of environmental
        dependence.
    - In essence, this must mean I should argue against transferability? We know
      that people make a load of tight-binding models and never use them.
    - Our use case is the fact we can do embedding with this, so we do not mind
      about /absolute/ transferability. We just want to predict the correct
      quantities relevant to our problem of defects in titanium.
    - Even without this currently we have failed to find a model. Perhaps
      non-orthogonality/environmental dependence is necessary to describe the
      model
    - Perhaps, using the BOP code, one can put in environment dependent terms
      and see if the dissociation distance changes, but this is quite a large
      ask in the timeframe
      

*** TODO Finalize model for fitting 
    DEADLINE: <2020-11-16 Mon>

** Remarks on tight-binding
   - Love it / Loathe it
   - Remark how with tight-binding we can see the different
     contributions to the total energy.
   - P. W. Anderson's theory on tight-binding. Dismissing it
     initially, but it's the right way to think about solids

* Surface Energies?

* Dislocations in pure metals
** Fe 
   - Comparison of the:
     - sd, non-orthogonal tight-binding models.
     - d-canonical model

*** DONE Peierls Potential 

*** DONE Plot d/sd peierls potential - How does non-O/sd change?
    DEADLINE: <2020-09-04 Fri>
    :PROPERTIES:
    :ORDERED:  t
    :END:
    - State "DONE"       from "WAITING"    [2020-09-04 Fri 14:01]
    - State "WAITING"    from "TODO"       [2020-09-02 Wed 10:18] \\
      Waiting for the simulations to finish
    :LOGBOOK:
    CLOCK: [2020-09-04 Fri 12:00]--[2020-09-04 Fri 14:01] =>  2:01
    CLOCK: [2020-09-01 Tue 15:37]--[2020-09-01 Tue 21:10] =>  5:33
    :END:

    - Not much difference between the canonical-d band model and the sd
      model. The difference is surely within the error of convergence for these
      calculations.  
     
** Ti
*** TODO Energy dependence and core energy 
    DEADLINE: <2020-12-20 Sun>
**** Think about why a d-canonical model would lead to large spreading? :NOTE:
     :LOGBOOK:
     CLOCK: [2020-09-02 Wed 10:46]--[2020-09-02 Wed 10:46] =>  0:00
     :END:
   [2020-09-02 Wed 10:46]
   [[file:~/Documents/docs/Management/org/refile.org::*Check Ti Models][Check Ti Models]]
*** TODO Core Energy difference in tbe - bop
    DEADLINE: <2020-11-16 Mon>
    - Tiny difference of 0.53 eV which determines the difference
      between each of the core energies.
*** TODO Calculate gamma surfaces for new model
    DEADLINE: <2020-11-23 Mon>
    - Planar faults 
      - Compare to DFT literature of Rodney, Curtin and Tarrat
      - Compare to other TB models
	- ICAMS model is rubbish!
*** Notes
    
    How does the orthogonal and canonical d-band model come into
    dislocation core structure. 

*** HOLD Are s-orbitals a necessary inclusion for dislocation mechanics? :HOLD:
    - State "HOLD"       from "WAITING"    [2020-09-03 Thu 12:46]
      Ruminate

*** HOLD How does overlap and non-orthogonality play a role? 
    - In Trinkle's NOTB model and Hennig's MEAM, the dissociation distance is
      small.
    - NOTB includes overlap and s-orbitals.
    - MEAM includes an angular dependence which varies with the density
      - This models the effects of bond bending.
      - Lenosky et al. modified the original MEAM potential by using cubic
        splines for the functional form. This removes the constraint of fixed
        angular char- acter and allows for additional flexibility of the
        potential. cite:hennig08_class_poten_descr_marten_phase
    
      
*** WAITING Checking that self-consistency doesn't change the dissociation distance :WAITING:

    - State "WAITING"    from "HOLD"       [2020-09-03 Thu 15:47] \\
      Waiting for mag calculation to finish
* Oxygen in Ti
  - TB >> DFT!
    - Because we can decompose the total energy into contributions
    - Look at how tight-binding allows us to see the physics by
      breaking down the total energy.

** TODO Defect clusters
   DEADLINE: <2020-12-16 Wed>

** TODO Binding of oxygen to dislocations if possible
   DEADLINE: <2021-01-10 Sun>

*** TODO Repulsive energy of oxygen
    DEADLINE: <2021-01-10 Sun>

*** TODO Concentration Analysis 
    DEADLINE: <2021-01-10 Sun>
   
** TODO Embedding Calculations
   DEADLINE: <2021-03-20 Sat>

*** TODO Just look at vacancies and oxygen? 

*** TODO Other Dislocation structures if models don't work?

   
       
* C in Fe
  - SKF report 
  - Onwards to kMC
** DONE Carbon binding to dislocations

** TODO Energy dependence with radius - Add data
   DEADLINE: <2020-11-16 Mon>

** TODO Concentration Analysis - Add in repulsive energy
   DEADLINE: <2020-09-25 Fri>

** TODO Line Tension Model

*** TODO Derive line tension equations 
    DEADLINE: <2020-09-25 Fri>
    :LOGBOOK:
    CLOCK: [2020-09-15 Tue 11:00]--[2020-09-16 Wed 11:39] => 24:39
    CLOCK: [2020-09-08 Tue 10:25]--[2020-09-08 Tue 11:52] =>  1:27
    :END:

*** TODO  Use simple models  
    DEADLINE: <2020-10-02 Fri>
    - Sine-Gordon
    - Others as found in Caillard [[file:~/Documents/books/Thermally%20Activated%20Mechanisms%20in%20Crystal%20Plasticity%20by%20D.%20Caillard%20and%20J.L.%20Martin%20(Eds.)%20(z-lib.org)%20(1).pdf][Thermally activated mechanisms in crystal plasticity]]

*** TODO Verify Itakura results with impelementation
    DEADLINE: <2020-10-16 Fri>

*** TODO Look at what we get from d/sd Iron models 
    DEADLINE: <2020-11-06 Fri>

* Wish-list
  - Line tension models maybe? 


